// ---------------------------\

// Завдання 1

// Напиши функцію logItems(array), яка отримує масив і використовує цикл for, який для кожного елемента масиву буде виводити в консоль повідомлення в форматі [номер елемента] - [значення елемента].

// Нумерація повинна починатися з 1. Наприклад, для першого елемента масиву ['Mango', 'Poly', 'Ajax'] з індексом 0 буде виведено '1 - Mango', а для індексу 2 виведе '3 - Ajax'.

const arrayNum = [8, 13, 21, 34, 55];
const arrayNum1 = [80, 130, 210, 340, 550];

function logItems(array){
	for (let i = 0; i < array.length; i++) {
		console.log(`Позиція елементу: ${[i + 1]}: ${array[i]}`);
	}
	console.log("------------------------");
}
logItems(arrayNum);
logItems(arrayNum1);
