"use strict"
console.log('Lesson-1 JS');
//? Створити змінну з іменем age і присвоїти їй значення свого віку.
const age = 18;
//?  Вивести значення цієї змінної в консоль.
console.log('Age:',age);
//! Код виконаного завдання


//? Створити змінну з іменем name і присвоїти їй значення свого імені.
const name = 'Vladyslav';
//? Вивести значення цієї змінної в консоль.
console.log('Name: ',name);
//! Код виконаного завдання

//? Створити змінну з іменем isStudent і присвоїти їй значення true або false,
const isStudent = true;
//? залежно від того, чи є студентом. Вивести значення цієї змінної в консоль.
console.log('Im student?: ',isStudent);

//! Код виконаного завдання


//? Створити змінну з іменем myString і присвоїти їй рядок з вашої улюбленою цитатою.
const myString ='\n„Когда ты поднимаешься, друзья узнают, кто ты. Когда ты падаешь, ты узнаёшь, кто друзья.“\nМайк Тайсон🥊🥊';
//? Вивести цей рядок в консоль.
console.log('Favorite quote: ',myString);

//! Код виконаного завдання


//? Створити змінну з іменем myNumber і присвоїти їй довільне числове значення.
const myNumber = 105;
//? Потім присвоїти цій змінній результат додавання до неї числа 10. Вивести значення myNumber в консоль.
const myResult = 10 + myNumber;
console.log(myResult);
//! Код виконаного завдання


//? Створити змінну з іменем myNull і присвоїти їй значення null. Вивести значення цієї змінної в консоль.
const myNull = null;
console.log(myNull);
//! Код виконаного завдання


//? Створити скрипт який виводить спливаюче вікно з запитом на введення імені користувача за допомогою prompt().
const getName = prompt("Wassssaaaap! What is your name bro?");
console.log(getName);
//? Після введення імені вивести повідомлення привітання з використанням введеного імені.
alert(`🙂 Welcome, ${getName}!`)
//! Код виконаного завдання


//? Створити скрипт який виводить спливаюче підтвердження за допомогою confirm().

//? Якщо користувач підтверджує дію, вивести повідомлення "Дякую за підтвердження!".

//? Якщо користувач відмовляється, вивести повідомлення "Дію відмінено!".


//! Код виконаного завдання
const acceptCookies = confirm("Click ‹YES› and accept this :D ")
? alert("Дякую за підтвердження! ✅")
: alert("Дію відмінено! ❌");
console.log(acceptCookies);

//? Створити скрипт який виводить спливаюче попередження за допомогою alert().

//? Вивести повідомлення про те, що дія небезпечна та попросити користувача підтвердити дію за допомогою confirm().

//? Якщо користувач підтверджує дію, вивести повідомлення "Дякую за підтвердження!".


//? Якщо користувач відмовляється, вивести повідомлення "Дію відмінено!"


//! Код виконаного завдання
alert("Дія небезпечна, тому просимо підтвердити свої дії 😣")
const accAlert = confirm("Чи підтверджуєте дію?");
accAlert
? alert("Дякую за підтвердження! ✅")
: alert("Дію відмінено! ❌") ;